{
  "backend/main.mo": "Motoko backend actor implementing user profiles, access control, course management, subject/topic storage, and study material handling with admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for build and deployment fixes.",
  "frontend-file-summaries.txt": "JSON-formatted list of frontend file summaries describing component purpose, hooks, utilities, and configuration modules.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Documentation explaining the root cause of frontend build failures, the implemented fixes, and step-by-step build and deploy instructions.",
  "frontend/index.css": "Tailwind-based global CSS defining color variables, dark mode overrides, and base styles.",
  "frontend/index.html": "Base HTML template loading the React app root element and main entry script.",
  "frontend/public/env.json": "Environment config specifying backend canister ID and network mode.",
  "frontend/src/App.tsx": "Main React component composing the full page structure with theme support and layout sections.",
  "frontend/src/backend.did.ts": "Candid interface factory defining all backend types and service methods for actor creation.",
  "frontend/src/components/CoursesSection.tsx": "Renders a tabbed course list with subject filters, icons, pricing, and loading states using data from course query hooks.",
  "frontend/src/components/Footer.tsx": "Displays site footer with branding, course links, subject anchors, and social icons, including smooth scroll behavior.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with logo, navigation menu, subject dropdown, and smooth scrolling to page sections.",
  "frontend/src/components/Hero.tsx": "Shows a hero banner with gradients, intro text, call‑to‑action buttons, and a decorative image.",
  "frontend/src/components/SubjectCard.tsx": "Represents a subject card with expandable topics, backend topic fetching, and study material link handling.",
  "frontend/src/components/SubjectsSection.tsx": "Renders a grid of predefined subjects as SubjectCards, each with metadata, icons, and backend-driven topics.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating courses, subjects, and topics using the backend actor.",
  "frontend/src/index.css": "Tailwind base and theme configuration with custom rose‑themed light/dark colors and styled scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/formatCurrency.ts": "Formats optional INR bigint values into displayable currency strings.",
  "frontend/src/utils/urlParams.ts": "Fetches a query parameter from the current page’s URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout utilities using CSS variables.",
  "project_state.json": "Describes current project state, requirements, known issues, and feature tracking metadata."
}