{
  "kind": "build_request",
  "title": "Resolve deployment error and complete build/deploy",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Investigate and fix the deployment error that is preventing the project from deploying successfully, and ensure the standard build + deploy workflow completes without errors for both the Motoko backend canister and the React frontend assets.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "START BUILD"
        ]
      },
      "acceptanceCriteria": [
        "A clean build completes for both backend and frontend with no errors.",
        "A deploy completes successfully (no deployment error) and produces a reachable, functioning app.",
        "The deployed app loads in the browser and can render the main sections (Hero, Subjects, Courses) without runtime crashes."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add a lightweight, developer-facing deployment troubleshooting note (in-repo documentation) describing the resolved root cause and the steps to reproduce a successful build and deploy going forward.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "START BUILD"
        ]
      },
      "acceptanceCriteria": [
        "Repository contains a short troubleshooting note that states the original failure mode, the fix applied, and the exact commands/steps to build and deploy successfully.",
        "Instructions do not reference unsupported external services and remain applicable to this Internet Computer canister project."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit any frontend files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text.",
    "Do not introduce unsupported technologies or integrations (no external DBs, no non-Internet-Identity auth, no WebSockets, no external cloud deployments)."
  ],
  "nonGoals": [
    "Do not add new course/subject/topic features beyond what is required to resolve the deployment failure.",
    "Do not redesign the UI or add new UI sections as part of this deployment fix unless necessary to prevent build/runtime errors.",
    "Do not change data models or stable state shape unless it is required to fix deployment (and only then with a conditional migration per project policy)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}