{
  "kind": "build_request",
  "title": "Add comprehensive higher-education course catalog (UG/PG/Doctoral)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expand the backend default course seeding so the app includes a comprehensive set of higher-education courses across Science, Arts, and Commerce categories, covering Undergraduate, Postgraduate, and Doctoral levels (in addition to the currently seeded items). Add commonly expected degree programs such as B.C.A., B.B.A., M.B.A., M.C.A., LL.B., LL.M., B.Ed., M.Ed., B.Pharm, M.Pharm, MBBS, and other widely recognized higher-education programs; ensure each added course has a non-empty title and description and uses the existing Category and Level enums.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add all course for higher education"
        ]
      },
      "acceptanceCriteria": [
        "Calling the existing admin seeding entrypoint (addDefaultCourses) results in a larger catalog that includes commonly expected higher-education degrees (e.g., B.C.A., B.B.A., M.B.A., M.C.A., LL.B., B.Ed., etc.) across available categories/levels.",
        "getAllCourses returns the expanded list sorted by id without traps.",
        "No newly added seeded course has an empty title or empty description."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Courses UI to display icons for any newly added course titles by extending the existing title->icon mapping, and ensure all new courses render correctly in the courses grid with their category badge and description (no broken image icons).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add all course for higher education"
        ]
      },
      "acceptanceCriteria": [
        "For every newly added course title that is seeded by the backend, the Courses section either shows the correct course icon (if provided) or omits the icon gracefully (no broken image placeholder).",
        "The Courses section lists the newly seeded higher-education courses after data refresh, with category badges displayed and descriptions visible (line-clamped as currently implemented)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add any missing static icon assets required by the updated course icon mapping as generated images under frontend/public/assets/generated and ensure the filenames match the mapping used in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add all course for higher education"
        ]
      },
      "acceptanceCriteria": [
        "All icon paths referenced by the courseIcons mapping resolve to real files in frontend/public/assets/generated.",
        "The app loads the Courses section without 404s for generated icon assets in the browser network panel."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or other frontend immutablePaths; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding external databases or non-IC storage systems.",
    "Building a full degree taxonomy/standardization system beyond adding a broader seeded list of higher-education courses."
  ],
  "imageRequirements": {
    "required": [
      "Minimal flat icon for \"BCA\" on transparent background (bca-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"BBA\" on transparent background (bba-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"MBA\" on transparent background (mba-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"MCA\" on transparent background (mca-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"LLB\" on transparent background (llb-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"LLM\" on transparent background (llm-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"BEd\" on transparent background (bed-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"MEd\" on transparent background (med-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"MBBS\" on transparent background (mbbs-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"BPharm\" on transparent background (bpharm-icon-transparent.dim_64x64.png)",
      "Minimal flat icon for \"MPharm\" on transparent background (mpharm-icon-transparent.dim_64x64.png)"
    ],
    "edits": []
  }
}